* Cisco路由器启动的主要步骤：
  * 检测路由器硬件
    * Power-On Self Test（POST）
    * 执行bootstrap
  * 定位加载Cisco IOS软件
    * 定位IOS
    * 加载IOS
  * 定位加载启动配置文件或进入配置模式
    * 启动程序搜寻配置文件

* Cisco Internetwork Operating System（IOS）
  * 就是为Cisco设备配备的系统软件。他是Cisco的一项核心技术，应用于路由器、局域网交换机、小型无线接入点、具有几十个接口的大型路由器以及许多其它设备
* Cisco IOS可为设备提供下列网络服务
  * 基本的路由和交换功能
  * 安全可靠地访问网络资源
  * 网络可伸缩性
* 可以通过多种方法访问CLI环境。最常用的方法有：
  * 控制台
  * Telnet或SSH
  * 辅助端口
* Cisco IOS模式
  * 用户执行模式		">"
  * 特权执行模式         “#” 
  * 全局配置模式         “(config)#”
  * 其它特定配置模式



## 常用命令

* 配置设备名称

  ```
  (conf t)# hostname 名称
  ```

* 配置用户密码

  * 控制台口令：用于限制人员通过控制台连接访问设备

  ```bash
  R1(config)# line console 0
  R1(config)# password 密码
  R1(config)# login
  ```

  * 使能口令：用于限制人员访问特权执行模式

  ```bash
  Router(config)# enable password 密码
  ```

  * 使能加密口令：经加密，用于限制人员访问特权执行模式

  ```bash
  Router(config)# enable secret 密码
  ```

  * VTY口令：用于限制人员通过Telnet访问设备

  ```bash
  Router(config)# line vty 0 4
  Router(config)# password 密码
  Router(config)# login
  ```

* 管理配置文件

  * 将当前配置写入启动配置文件

  ```bash
  R1# write
  R1# copy running-config startup-config
  ```

  * 删除启动配置文件

  ```bash
  R1# erase startup-config
  R1# delete flash:config.text
  ```

* 接口配置

  * 进入接口

  ```bash
  R1(config)# interface ethernet 0/0
  R1(config-if)#
  ```

  * 为接口配置IP地址

  ```bash
  R1(config-if)# ip address 192.168.1.1 255.255.255.0
  ```

  * 激活接口

  ```bash
  R1(config-if)# no shutdown	//Cisco设备接口默认shutdown状态
  ```

  * 配置serial接口

  ```bash
  R1(config)# interface serial 0/0
  R1(config-if)# ip address 192.168.1.1 255.255.255.0
  R1(config-if)# no shutdown
  R1(config-if)# clock rate 64000		// 在DCE端配置时钟信号
  ```

* show命令

  ```bash
  show ?
  show version		// 查看当前操作系统版本
  show running-config	// 查看运行配置
  show startup-config	// 查看启动配置
  
  show flash			// 查看flash
  show cpu			// 查看cpu利用率
  show memory			// 查看内存使用情况
  show interface		// 查看端口
  ```
